energia/Energia/hardware/msp430/cores/msp430/wiring_analog.c
/*
  ************************************************************************
  *	wiring_analog.c
  *
  *	Arduino core files for MSP430
  *		Copyright (c) 2012 Robert Wessels. All right reserved.
  *
  *
  ***********************************************************************
  Derived from:
  wiring_analog.c - analog input and output
  Part of Arduino - http://www.arduino.cc/

  Copyright (c) 2005-2006 David A. Mellis

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General
  Public License along with this library; if not, write to the
  Free Software Foundation, Inc., 59 Temple Place, Suite 330,
  Boston, MA  02111-1307  USA
*/

#include "wiring_private.h"
#include "pins_energia.h"

#if defined(__MSP430_HAS_ADC10__) && !defined(ADC10ENC)
#define ADC10ENC ENC 
#endif
#if defined(__MSP430_HAS_ADC10__)
#define ADCxMEM0 ADC10MEM 
#endif
#if defined(__MSP430_HAS_ADC10_A__)
#define ADCxMEM0 ADC10MEM 
#endif
#if defined(__MSP430_HAS_ADC10_B__)
#define REFV_MASK 0x70
#define REF_MASK 0x31
#define ADCxMEM0 ADC10MEM0 
#endif
#if defined(__MSP430_HAS_ADC12_PLUS__)
#define REFV_MASK 0x0070
#define REF_MASK 0xB1
#define ADCxMEM0 ADC12MEM0 
#endif
#if defined(__MSP430_HAS_ADC12_B__)
#define REFV_MASK 0x0F00
#define REF_MASK 0x31
#define ADCxMEM0 ADC12MEM0 
#endif

#if defined(__MSP430_HAS_ADC10__) || defined(__MSP430_HAS_ADC10_B__) || defined(__MSP430_HAS_ADC12_PLUS__) || defined(__MSP430_HAS_ADC12_B__)
uint16_t analog_reference = DEFAULT, analog_period = F_CPU/490, analog_div = ID_0, analog_res=255; // devide clock with 0, 2, 4, 8

void analogReference(uint16_t mode)
{
	// can't actually set the register here because the default setting
	// will connect AVCC and the AREF pin, which would cause a short if
	// there's something connected to AREF.
	analog_reference = mode;
}
#endif


//TODO: Can be a lot more efficiant.
//      - lower clock rated / input devider to conserve Energia.
//      - pin configuration logic.

// Note set frequency before sending analog value
// Lowest fequency is defined by clock frequency F_CPU, and max counter value 2^16-1
// fmin = F_CPU / 2^16
void analogFrequency(uint32_t freq)
{
	if ( freq <= F_CPU/(8*65334L) ) {
		return;  // Out of luck, sorry pal.
	}

	if ( freq <= F_CPU/(4*65334L) ) {
		analog_div = ID_3;
		freq *= 8;
	} else if ( freq <= F_CPU/(2*65334L) ) {
		analog_div = ID_2;
		freq *= 4;
	} else if ( freq <= F_CPU/(1*65334L) ) {
		analog_div = ID_1;
		freq *= 2;
	} else {
		analog_div = ID_0;
	}
	analog_period = F_CPU/freq;
}

// Set the resulution (nr of counts for 100%), default = 255, large values may not work at all frequencies
void analogResolution(uint16_t res)
{
	analog_res = res;
}

/* Timer_A delayed-CCR-update ISRs. */

#if defined(__MSP430_HAS_TA3__) || defined(__MSP430_HAS_T0A3__)
uint16_t timera0_ccr_dblbuf[2];
#pragma vector=TIMER0_A0_VECTOR
__interrupt void TA0_CCR_updater()
{
	TA0CCR1 = timera0_ccr_dblbuf[0];
	TA0CCR2 = timera0_ccr_dblbuf[1];
	TA0CCTL0 &= ~CCIE;
}
#endif

#if defined(__MSP430_HAS_TA5__) || defined(__MSP430_HAS_T0A5__) 
uint16_t timera0_ccr_dblbuf[4];
#pragma vector=TIMER0_A0_VECTOR
__interrupt void TA0_CCR_updater()
{
	TA0CCR1 = timera0_ccr_dblbuf[0];
	TA0CCR2 = timera0_ccr_dblbuf[1];
	TA0CCR3 = timera0_ccr_dblbuf[2];
	TA0CCR4 = timera0_ccr_dblbuf[3];
	TA0CCTL0 &= ~CCIE;
}
#endif

#if defined(__MSP430_HAS_T1A3__) 
uint16_t timera1_ccr_dblbuf[2];
#pragma vector=TIMER1_A0_VECTOR
__interrupt void TA1_CCR_updater()
{
	TA1CCR1 = timera1_ccr_dblbuf[0];
	TA1CCR2 = timera1_ccr_dblbuf[1];
	TA1CCTL0 &= ~CCIE;
}
#endif

#if defined(__MSP430_HAS_T2A3__)  
uint16_t timera2_ccr_dblbuf[2];
#pragma vector=TIMER2_A0_VECTOR
__interrupt void TA2_CCR_updater()
{
	TA2CCR1 = timera2_ccr_dblbuf[0];
	TA2CCR2 = timera2_ccr_dblbuf[1];
	TA2CCTL0 &= ~CCIE;
}
#endif


//Arduino specifies ~490 Hz for analog out PWM so we follow suit.
#define PWM_PERIOD analog_period // F_CPU/490
#define PWM_DUTY(x) ( (unsigned long)x*PWM_PERIOD / (unsigned long)analog_res )
void analogWrite(uint8_t pin, int val)
{
 	if (val == 0)
	{
		pinMode(pin, OUTPUT);
		digitalWrite(pin, LOW); // set pin to LOW when duty cycle is 0
                                        // digitalWrite will take care of invalid pins
	}
	else if (val == analog_res)
	{
		pinMode(pin, OUTPUT);
		digitalWrite(pin, HIGH); // set pin HIGH when duty cycle is 255
                                         // digitalWrite will take care of invalid pins
	}
	else
	{

	        uint8_t bit = digitalPinToBitMask(pin); // get pin bit
	        uint8_t port = digitalPinToPort(pin);   // get pin port
	        volatile uint8_t *sel;
                
                if (port == NOT_A_PORT) return; // pin on timer?

	        sel = portSelRegister(port); // get the port function select register address
		uint16_t is_already_pwm = false;  // uint16_t is fine since this gets optimized away using a register anyhow
#if (defined(P1SEL2_) || defined(P1SEL2))
#define is_using_two_pxsel
		volatile uint8_t *selx = portSel2Register(port);
#endif
#if (defined(P1SEL1_) || defined(P1SEL1))
#define is_using_two_pxsel
		volatile uint8_t *selx = portSel1Register(port);
#endif

		#ifdef is_using_two_pxsel
		if (!(*sel & bit) && !(*selx & bit)) {  // Make sure we're not in an alternate non-Timer mode on this pin.
		#else
		if (!(*sel & bit)) {
		#endif
			pinMode(pin, OUTPUT);  // Prepare pin for timer-output
			*sel |= bit;           // set bit in pin function select register  
		} else {
			is_already_pwm = true;
		}

		uint16_t ccrval = PWM_DUTY(val);  // get the 32-bit math done early

		switch(digitalPinToTimer(pin)) {                // which timer and CCR?
 			//case: T0A0                            // CCR0 used as period register
			case T0A1:                              // TimerA0 / CCR1
				if (!is_already_pwm) {
					TA0CCR0 = PWM_PERIOD;           // PWM Period
					TA0CCTL1 = OUTMOD_7;            // reset/set
					TA0CCR1 = ccrval;       // PWM duty cycle
					timera0_ccr_dblbuf[0] = ccrval;
					TA0CTL = TASSEL_2 + MC_1 + analog_div;       // SMCLK, up mode
				} else {
					timera0_ccr_dblbuf[0] = ccrval;
					TA0CCTL0 |= CCIE;
				}
                                break;
#if defined(__MSP430_HAS_TA3__) || defined(__MSP430_HAS_T0A3__) || defined(__MSP430_HAS_T0A5__) || defined(__MSP430_HAS_TA5__) 
 			case T0A2:                              // TimerA0 / CCR2
				if (!is_already_pwm) {
					TA0CCR0 = PWM_PERIOD;           // PWM Period
					TA0CCTL2 = OUTMOD_7;            // reset/set
					TA0CCR2 = ccrval;       // PWM duty cycle
					timera0_ccr_dblbuf[1] = ccrval;
					TA0CTL = TASSEL_2 + MC_1 + analog_div;       // SMCLK, up mode
				} else {
					timera0_ccr_dblbuf[1] = ccrval;
					TA0CCTL0 |= CCIE;
				}
                                break;
#endif
#if defined(__MSP430_HAS_TA5__) || defined(__MSP430_HAS_T0A5__) 
 			case T0A3:                              // TimerA0 / CCR3
				if (!is_already_pwm) {
					TA0CCR0 = PWM_PERIOD;           // PWM Period
					TA0CCTL3 = OUTMOD_7;            // reset/set
					TA0CCR3 = ccrval;       // PWM duty cycle
					timera0_ccr_dblbuf[2] = ccrval;
					TA0CTL = TASSEL_2 + MC_1 + analog_div;       // SMCLK, up mode
				} else {
					timera0_ccr_dblbuf[2] = ccrval;
					TA0CCTL0 |= CCIE;
				}
                                break;
 			case T0A4:                              // TimerA0 / CCR4
				if (!is_already_pwm) {
					TA0CCR0 = PWM_PERIOD;           // PWM Period
					TA0CCTL4 = OUTMOD_7;            // reset/set
					TA0CCR4 = ccrval;       // PWM duty cycle
					timera0_ccr_dblbuf[3] = ccrval;
					TA0CTL = TASSEL_2 + MC_1 + analog_div;       // SMCLK, up mode
				} else {
					timera0_ccr_dblbuf[3] = ccrval;
					TA0CCTL0 |= CCIE;
				}
                                break;
#endif
#if defined(__MSP430_HAS_T1A3__) 
 			//case: T1A0                            // CCR0 used as period register
			case T1A1:                              // TimerA1 / CCR1
				if (!is_already_pwm) {
					TA1CCR0 = PWM_PERIOD;           // PWM Period
					TA1CCTL1 = OUTMOD_7;            // reset/set
					TA1CCR1 = ccrval;       // PWM duty cycle
					timera1_ccr_dblbuf[0] = ccrval;
					TA1CTL = TASSEL_2 + MC_1 + analog_div;       // SMCLK, up mode
				} else {
					timera1_ccr_dblbuf[0] = ccrval;
					TA1CCTL0 |= CCIE;
				}
                                break;
 			case T1A2:                              // TimerA1 / CCR2
				if (!is_already_pwm) {
					TA1CCR0 = PWM_PERIOD;           // PWM Period
					TA1CCTL2 = OUTMOD_7;            // reset/set
					TA1CCR2 = ccrval;       // PWM duty cycle
					timera1_ccr_dblbuf[1] = ccrval;
					TA1CTL = TASSEL_2 + MC_1 + analog_div;       // SMCLK, up mode
				} else {
					timera1_ccr_dblbuf[1] = ccrval;
					TA1CCTL0 |= CCIE;
				}
                                break;
#endif
#if defined(__MSP430_HAS_T2A3__)  
 			//case: T2A0                            // CCR0 used as period register
			case T2A1:                              // TimerA2 / CCR1
				if (!is_already_pwm) {
					TA2CCR0 = PWM_PERIOD;           // PWM Period
					TA2CCTL1 = OUTMOD_7;            // reset/set
					TA2CCR1 = ccrval;       // PWM duty cycle
					timera2_ccr_dblbuf[0] = ccrval;
					TA2CTL = TASSEL_2 + MC_1 + analog_div;       // SMCLK, up mode
				} else {
					timera2_ccr_dblbuf[0] = ccrval;
					TA2CCTL0 |= CCIE;
				}
                                break;
 			case T2A2:                              // TimerA2 / CCR2
				if (!is_already_pwm) {
					TA2CCR0 = PWM_PERIOD;           // PWM Period
					TA2CCTL2 = OUTMOD_7;            // reset/set
					TA2CCR2 = ccrval;       // PWM duty cycle
					timera2_ccr_dblbuf[1] = ccrval;
					TA2CTL = TASSEL_2 + MC_1 + analog_div;       // SMCLK, up mode
				} else {
					timera2_ccr_dblbuf[1] = ccrval;
					TA2CCTL0 |= CCIE;
				}
                                break;
#endif
#if defined(__MSP430_HAS_T0B3__) || defined(__MSP430_HAS_T0B7__) 
 			//case: T0B0                            // CCR0 used as period register
 			case T0B1:                              // TimerB0 / CCR1
				if (!is_already_pwm) {
					TB0CCR0 = PWM_PERIOD;           // PWM Period
					TB0CCTL1 = OUTMOD_7 | CLLD_1;   // reset/set, CCR updates when TBR counts back to 0
					TB0CCR1 = ccrval;       // PWM duty cycle
					TB0CTL = TBSSEL_2 + MC_1 + analog_div;       // SMCLK, up mode
				} else {
					TB0CCR1 = ccrval;       // PWM duty cycle
				}
                                break;
 			case T0B2:                              // TimerB0 / CCR1
				if (!is_already_pwm) {
					TB0CCR0 = PWM_PERIOD;           // PWM Period
					TB0CCTL2 = OUTMOD_7 | CLLD_1;   // reset/set, CCR updates when TBR counts back to 0
					TB0CCR2 = ccrval;       // PWM duty cycle
					TB0CTL = TBSSEL_2 + MC_1 + analog_div;       // SMCLK, up mode
				} else {
					TB0CCR2 = ccrval;       // PWM duty cycle
				}
                                break;
#endif
#if defined(__MSP430_HAS_T0B7__) 
 			case T0B3:                              // TimerB0 / CCR3
				if (!is_already_pwm) {
					TB0CCR0 = PWM_PERIOD;           // PWM Period
					TB0CCTL3 = OUTMOD_7 | CLLD_1;   // reset/set, CCR updates when TBR counts back to 0
					TB0CCR3 = ccrval;       // PWM duty cycle
					TB0CTL = TBSSEL_2 + MC_1 + analog_div;       // SMCLK, up mode
				} else {
					TB0CCR3 = ccrval;       // PWM duty cycle
				}
                                break;
 			case T0B4:                              // TimerB0 / CCR4
				if (!is_already_pwm) {
					TB0CCR0 = PWM_PERIOD;           // PWM Period
					TB0CCTL4 = OUTMOD_7 | CLLD_1;   // reset/set, CCR updates when TBR counts back to 0
					TB0CCR4 = ccrval;       // PWM duty cycle
					TB0CTL = TBSSEL_2 + MC_1 + analog_div;       // SMCLK, up mode
				} else {
					TB0CCR4 = ccrval;       // PWM duty cycle
				}
                                break;
 			case T0B5:                              // TimerB0 / CCR5
				if (!is_already_pwm) {
					TB0CCR0 = PWM_PERIOD;           // PWM Period
					TB0CCTL5 = OUTMOD_7 | CLLD_1;   // reset/set, CCR updates when TBR counts back to 0
					TB0CCR5 = ccrval;       // PWM duty cycle
					TB0CTL = TBSSEL_2 + MC_1 + analog_div;       // SMCLK, up mode
				} else {
					TB0CCR5 = ccrval;       // PWM duty cycle
				}
                                break;
 			case T0B6:                              // TimerB0 / CCR6
				if (!is_already_pwm) {
					TB0CCR0 = PWM_PERIOD;           // PWM Period
					TB0CCTL6 = OUTMOD_7 | CLLD_1;   // reset/set, CCR updates when TBR counts back to 0
					TB0CCR6 = ccrval;       // PWM duty cycle
					TB0CTL = TBSSEL_2 + MC_1 + analog_div;       // SMCLK, up mode
				} else {
					TB0CCR6 = ccrval;       // PWM duty cycle
				}
                                break;
#endif
#if defined(__MSP430_HAS_T1B3__) 
 			//case: T1B0                            // CCR0 used as period register
 			case T1B1:                              // TimerB0 / CCR1
				if (!is_already_pwm) {
					TB1CCR0 = PWM_PERIOD;           // PWM Period
					TB1CCTL1 = OUTMOD_7 | CLLD_1;   // reset/set, CCR updates when TBR counts back to 0
					TB1CCR1 = ccrval;       // PWM duty cycle
					TB1CTL = TBSSEL_2 + MC_1 + analog_div;       // SMCLK, up mode
				} else {
					TB1CCR1 = ccrval;       // PWM duty cycle
				}
                                break;
 			case T1B2:                              // TimerB0 / CCR1
				if (!is_already_pwm) {
					TB1CCR0 = PWM_PERIOD;           // PWM Period
					TB1CCTL2 = OUTMOD_7 | CLLD_1;   // reset/set, CCR updates when TBR counts back to 0
					TB1CCR2 = ccrval;       // PWM duty cycle
					TB1CTL = TBSSEL_2 + MC_1 + analog_div;       // SMCLK, up mode
				} else {
					TB1CCR2 = ccrval;       // PWM duty cycle
				}
                                break;
#endif
#if defined(__MSP430_HAS_T2B3__) 
 			//case: T1B0                            // CCR0 used as period register
 			case T2B1:                              // TimerB0 / CCR1
				if (!is_already_pwm) {
					TB2CCR0 = PWM_PERIOD;           // PWM Period
					TB2CCTL1 = OUTMOD_7 | CLLD_1;   // reset/set, CCR updates when TBR counts back to 0
					TB2CCR1 = ccrval;       // PWM duty cycle
					TB2CTL = TBSSEL_2 + MC_1 + analog_div;       // SMCLK, up mode
				} else {
					TB2CCR1 = ccrval;       // PWM duty cycle
				}
                                break;
 			case T2B2:                              // TimerB0 / CCR1
				if (!is_already_pwm) {
					TB2CCR0 = PWM_PERIOD;           // PWM Period
					TB2CCTL2 = OUTMOD_7 | CLLD_1;   // reset/set, CCR updates when TBR counts back to 0
					TB2CCR2 = ccrval;       // PWM duty cycle
					TB2CTL = TBSSEL_2 + MC_1 + analog_div;       // SMCLK, up mode
				} else {
					TB2CCR2 = ccrval;       // PWM duty cycle
				}
                                break;
#endif
 
                        case NOT_ON_TIMER:                      // not on a timer output pin
			default:                                // or TxA0 pin
				pinMode(pin, OUTPUT);
				if (val <= (analog_res >> 1)) {
					digitalWrite(pin, LOW); // 
				} else {
					digitalWrite(pin, HIGH);
				}
                }
        }
}


uint16_t analogRead(uint8_t pin)
{
// make sure we have an ADC
	uint8_t channel;
	
	// Check if pin is valid
	if (pin==NOT_ON_ADC)
		return 0;
	// Check if pin is a special analog pin (A10 = temp sensor, A11 = Vcc/2, etc.)
	if (pin >=128)
		channel = pin - 128;
	else
		channel = digitalPinToADCIn(pin);
	
#if defined(__MSP430_HAS_ADC10__) || defined(__MSP430_HAS_ADC10_B__) || defined(__MSP430_HAS_ADC12_PLUS__) || defined(__MSP430_HAS_ADC12_B__)
    //  0000 A0
    //  0001 A1
    //  0010 A2
    //  0011 A3
    //  0100 A4
    //  0101 A5
    //  0110 A6
    //  0111 A7
    //  1010 Internal temperature sensor

